openfoam-adapter_v1.1.0_OpenFOAMv1812-v2112-newer-cht-rework/tutorials/FF/pipe-pipe/sonicLiquidFoam-sonicLiquidFoam/Fluid1/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (outlet);
    
    readData
    (
      Pressure
    );
    
    writeData
    (
      Velocity
      PressureGradient
    );
  };
};